RT-Thread/rt-thread/bsp/at32/libraries/AT32F45x_Firmware_Library/drivers/inc/at32f45x_xmc.h
} xmc_bank1_tmgwr_reg_type;

/**
  * @brief xmc bank1 registers
  */
typedef struct
{
  /**
    * @brief xmc bank1 ctrl and tmg register, offset:0x00~0x1C
    */
  xmc_bank1_ctrl_tmg_reg_type ctrl_tmg_group[4];

  /**
    * @brief xmc bank1 reserved register, offset:0x20~0x100
    */
  __IO uint32_t reserved1[57];

 /**
    * @brief xmc bank1 tmgwr register, offset:0x104~0x11C
    */
  xmc_bank1_tmgwr_reg_type tmgwr_group[4];

  /**
    * @brief xmc bank1 reserved register, offset:0x120~0x220
    */
  __IO uint32_t reserved2[63];

  /**
    * @brief xmc bank1 ext register, offset:0x220~0x22C
    */
  union
  {
    __IO uint32_t ext[4];
    struct
    {
      __IO uint32_t buslatw2w            : 8; /* [7:0] */
      __IO uint32_t buslatr2r            : 8; /* [15:8] */
      __IO uint32_t reserved1            : 16;/* [31:16] */
    } ext_bit[4];
  };

} xmc_bank1_type;

/**
  * @brief xmc sdram type
  */
typedef struct
{
  /**
    * @brief xmc sdram ctrl register, offset:0x140~0x144
    */
  union
  {
    __IO uint32_t ctrl[2];
    struct
    {
      __IO uint32_t ca                   : 2; /* [1:0] */
      __IO uint32_t ra                   : 2; /* [3:2] */
      __IO uint32_t db                   : 2; /* [5:4] */
      __IO uint32_t inbk                 : 1; /* [6] */
      __IO uint32_t cas                  : 2; /* [8:7] */
      __IO uint32_t wrp                  : 1; /* [9] */
      __IO uint32_t clkdiv               : 2; /* [11:10] */
      __IO uint32_t bstr                 : 1; /* [12] */
      __IO uint32_t rd                   : 2; /* [14:13] */
      __IO uint32_t reserved1            : 17;/* [31:15] */
    } ctrl_bit[2];
  };

  /**
    * @brief xmc sdram tm register, offset:0x148~0x14C
    */
  union
  {
    __IO uint32_t tm[2];
    struct
    {
      __IO uint32_t tmrd                 : 4; /* [3:0] */
      __IO uint32_t txsr                 : 4; /* [7:4] */
      __IO uint32_t tras                 : 4; /* [11:8] */
      __IO uint32_t trc                  : 4; /* [15:12] */
      __IO uint32_t twr                  : 4; /* [19:16] */
      __IO uint32_t trp                  : 4; /* [23:20] */
      __IO uint32_t trcd                 : 4; /* [27:24] */
      __IO uint32_t reserved1            : 4; /* [31:28] */
    } tm_bit[2];

  };

/**
    * @brief xmc sdram cmd register, offset:0x150
    */
  union
  {
    __IO uint32_t cmd;
    struct
    {
      __IO uint32_t cmd                  : 3; /* [2:0] */
      __IO uint32_t bk2                  : 1; /* [3] */
      __IO uint32_t bk1                  : 1; /* [4] */
      __IO uint32_t art                  : 4; /* [8:5] */
      __IO uint32_t mrd                  : 13;/* [21:9] */
      __IO uint32_t reserved1            : 10;/* [31:22] */
    } cmd_bit;
  };

  /**
    * @brief xmc sdram rcnt register, offset:0x154
    */
  union
  {
    __IO uint32_t rcnt;
    struct
    {
      __IO uint32_t errc                 : 1; /* [0] */
      __IO uint32_t rc                   : 13;/* [13:1] */
      __IO uint32_t erien                : 1; /* [14] */
      __IO uint32_t reserved1            : 17;/* [31:15] */
    } rcnt_bit;
  };

  /**
    * @brief xmc sdram sts register, offset:0x158
    */
  union
  {
    __IO uint32_t sts;
    struct
    {
      __IO uint32_t err                  : 1; /* [0] */
      __IO uint32_t bk1sts               : 2; /* [2:1] */
      __IO uint32_t bk2sts               : 2; /* [4:3] */
      __IO uint32_t busy                 : 1; /* [5] */
      __IO uint32_t reserved1            : 26;/* [31:6] */
    } sts_bit;
  };
  __IO uint32_t reserved1[9];

  /**
    * @brief xmc sdram clkdiv1, offset:0x180
    */
  union
  {
    __IO uint32_t clkdiv1;
    struct
    {
      __IO uint32_t reserved1            : 4; /* [3:0] */
      __IO uint32_t clkdiv1              : 1; /* [4] */
      __IO uint32_t reserved2            : 27;/* [31:5] */
    } clkdiv1_bit;
  };
}xmc_sdram_type;

/**
  * @}
  */

#define XMC_BANK1                        ((xmc_bank1_type *) XMC_BANK1_REG_BASE)
#define XMC_SDRAM                        ((xmc_sdram_type *) XMC_SDRAM_REG_BASE)

/** @defgroup XMC_exported_functions
  * @{
  */

void xmc_nor_sram_reset(xmc_nor_sram_subbank_type xmc_subbank);
void xmc_nor_sram_init(xmc_norsram_init_type* xmc_norsram_init_struct);
void xmc_nor_sram_timing_config(xmc_norsram_timing_init_type* xmc_rw_timing_struct,
                                xmc_norsram_timing_init_type* xmc_w_timing_struct);
void xmc_norsram_default_para_init(xmc_norsram_init_type* xmc_nor_sram_init_struct);
void xmc_norsram_timing_default_para_init(xmc_norsram_timing_init_type* xmc_rw_timing_struct,
                                          xmc_norsram_timing_init_type* xmc_w_timing_struct);
void xmc_nor_sram_enable(xmc_nor_sram_subbank_type xmc_subbank, confirm_state new_state);
void xmc_ext_timing_config(volatile xmc_nor_sram_subbank_type xmc_sub_bank, uint16_t w2w_timing, uint16_t r2r_timing);
void xmc_interrupt_enable(xmc_class_bank_type xmc_bank, xmc_interrupt_sources_type xmc_int, confirm_state new_state);
flag_status xmc_flag_status_get(xmc_class_bank_type xmc_bank, xmc_interrupt_flag_type xmc_flag);
void xmc_flag_clear(xmc_class_bank_type xmc_bank, xmc_interrupt_flag_type xmc_flag);
void xmc_sdram_reset(xmc_sdram_bank_type xmc_bank);
void xmc_sdram_init(xmc_sdram_init_type *xmc_sdram_init_struct, xmc_sdram_timing_type *xmc_sdram_timing_struct);
void xmc_sdram_default_para_init(xmc_sdram_init_type *xmc_sdram_init_struct, xmc_sdram_timing_type *xmc_sdram_timing_struct);
void xmc_sdram_cmd(xmc_sdram_cmd_type *xmc_sdram_cmd_struct);
uint32_t xmc_sdram_status_get(xmc_sdram_bank_type xmc_bank);
void xmc_sdram_refresh_counter_set(uint32_t counter);
void xmc_sdram_auto_refresh_set(uint32_t number);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif
